{
 "metadata": {
  "image": [],
  "title": "Micropayment Channel",
  "description": "For larger payments, Dash transaction fees are very low as a percentage of the total transaction value, so it makes more sense to protect payments with immediately-broadcast separate transactions.",
  "keywords": "",
  "robots": "index"
 },
 "mdx": {
  "altBody": "",
  "status": "rdmd"
 },
 "api": {
  "method": "get",
  "url": "",
  "auth": "required",
  "results": {
   "codes": [
    {
     "status": 200,
     "language": "json",
     "code": "{}",
     "name": ""
    },
    {
     "status": 400,
     "language": "json",
     "code": "{}",
     "name": ""
    }
   ]
  },
  "params": []
 },
 "next": {
  "description": "",
  "pages": [
   {
    "type": "doc",
    "icon": "file-text-o",
    "name": "Wallets",
    "slug": "core-guide-wallets",
    "category": "Core Guides"
   }
  ]
 },
 "algolia": {
  "recordCount": 1,
  "publishPending": false,
  "translationFailure": false,
  "updatedAt": "2023-02-21T19:16:05.537Z"
 },
 "title": "Micropayment Channel",
 "icon": "",
 "updates": [],
 "type": "basic",
 "slug": "core-guide-contracts-micropayment-channel",
 "excerpt": "",
 "body": "Alice also works part-time moderating forum posts for Bob. Every time someone posts to Bob's busy forum, Alice skims the post to make sure it isn't offensive or spam. Alas, Bob often forgets to pay her, so Alice demands to be paid immediately after each post she approves or rejects. Bob says he can't do that because hundreds of small payments will cost him thousands of <<glossary:duffs>> in transaction fees, so Alice suggests they use a micropayment channel.\n\nBob asks Alice for her <<glossary:public key>> and then creates two <<glossary:transactions>>. The first transaction pays 100 millidash to a P2SH output whose 2-of-2 multisig <<glossary:redeem script>> requires <<glossary:signatures>> from both Alice and Bob. This is the bond transaction. Broadcasting this transaction would let Alice hold the millidash hostage, so Bob keeps this transaction private for now and creates a second transaction.\n\nThe second transaction spends all of the first transaction's millidash (minus a transaction fee) back to Bob after a 24 hour delay enforced by locktime. This is the refund transaction. Bob can't sign the refund transaction by himself, so he gives it to Alice to sign, as shown in the illustration below.\n\n![Micropayment Channel Example](https://dash-docs.github.io/img/dev/en-micropayment-channel.svg)\n\nAlice checks that the refund transaction's locktime is 24 hours in the future, signs it, and gives a copy of it back to Bob. She then asks Bob for the bond transaction and checks that the refund transaction spends the output of the bond transaction. She can now broadcast the bond transaction to the network to ensure Bob has to wait for the time lock to expire before further spending his millidash. Bob hasn't actually spent anything so far, except possibly a small <<glossary:transaction fee>>, and he'll be able to broadcast the refund transaction in 24 hours for a full refund.\n\nNow, when Alice does some work worth 1 millidash, she asks Bob to create and sign a new version of the refund transaction.  Version two of the transaction spends 1 millidash to Alice and the other 99 back to Bob; it does not have a locktime, so Alice can sign it and spend it whenever she wants.  (But she doesn't do that immediately.)\n\nAlice and Bob repeat these work-and-pay steps until Alice finishes for the day, or until the time lock is about to expire.  Alice signs the final version of the refund transaction and broadcasts it, paying herself and refunding any remaining balance to Bob.  The next day, when Alice starts work, they create a new micropayment channel.\n\nIf Alice fails to broadcast a version of the refund transaction before its time lock expires, Bob can broadcast the first version and receive a full refund. This is one reason micropayment channels are best suited to small payments---if Alice's Internet service goes out for a few hours near the time lock expiry, she could be cheated out of her payment.\n\nTransaction malleability, discussed in the [Transactions section](core-guide-transactions-transaction-malleability), is another reason to limit the value of micropayment channels. If someone uses transaction malleability to break the link between the two transactions, Alice could hold Bob's 100 millidash hostage even if she hadn't done any work.\n\nFor larger payments, Dash transaction fees are very low as a percentage of the total transaction value, so it makes more sense to protect payments with immediately-broadcast separate transactions.",
 "order": 1,
 "isReference": false,
 "deprecated": false,
 "hidden": false,
 "sync_unique": "",
 "link_url": "",
 "link_external": false,
 "reusableContent": [],
 "previousSlug": "",
 "slugUpdatedAt": "2022-09-20T18:58:07.901Z",
 "revision": 2,
 "_id": "63f5176df91c7700118e7809",
 "version": "63f5176df91c7700118e7825",
 "updatedAt": "2019-11-13T20:40:57.589Z",
 "createdAt": "2019-10-28T19:38:07.723Z",
 "project": "5daf2e65f4109c0040fd51e1",
 "user": "62b2101422da70001ee51d95",
 "parentDoc": "63f5176df91c7700118e7807",
 "category": "63f5176df91c7700118e779e",
 "__v": 1,
 "pendingAlgoliaPublish": false,
 "isApi": false,
 "id": "63f5176df91c7700118e7809",
 "body_html": "<p>Alice also works part-time moderating forum posts for Bob. Every time someone posts to Bob&#x27;s busy forum, Alice skims the post to make sure it isn&#x27;t offensive or spam. Alas, Bob often forgets to pay her, so Alice demands to be paid immediately after each post she approves or rejects. Bob says he can&#x27;t do that because hundreds of small payments will cost him thousands of <span class=\"GlossaryItem-trigger\">duffs</span> in transaction fees, so Alice suggests they use a micropayment channel.</p>\n<p>Bob asks Alice for her <span class=\"GlossaryItem-trigger\">public key</span> and then creates two <span class=\"GlossaryItem-trigger\">transactions</span>. The first transaction pays 100 millidash to a P2SH output whose 2-of-2 multisig <span class=\"GlossaryItem-trigger\">redeem script</span> requires <span class=\"GlossaryItem-trigger\">signatures</span> from both Alice and Bob. This is the bond transaction. Broadcasting this transaction would let Alice hold the millidash hostage, so Bob keeps this transaction private for now and creates a second transaction.</p>\n<p>The second transaction spends all of the first transaction&#x27;s millidash (minus a transaction fee) back to Bob after a 24 hour delay enforced by locktime. This is the refund transaction. Bob can&#x27;t sign the refund transaction by himself, so he gives it to Alice to sign, as shown in the illustration below.</p>\n<p><span aria-label=\"Micropayment Channel Example\" class=\"img lightbox closed\" role=\"button\" tabindex=\"0\"><span class=\"lightbox-inner\"><img alt=\"Micropayment Channel Example\" loading=\"lazy\" src=\"https://dash-docs.github.io/img/dev/en-micropayment-channel.svg\" align=\"\" caption=\"\" height=\"auto\" title=\"\" width=\"auto\"/></span></span></p>\n<p>Alice checks that the refund transaction&#x27;s locktime is 24 hours in the future, signs it, and gives a copy of it back to Bob. She then asks Bob for the bond transaction and checks that the refund transaction spends the output of the bond transaction. She can now broadcast the bond transaction to the network to ensure Bob has to wait for the time lock to expire before further spending his millidash. Bob hasn&#x27;t actually spent anything so far, except possibly a small <span class=\"GlossaryItem-trigger\">transaction fee</span>, and he&#x27;ll be able to broadcast the refund transaction in 24 hours for a full refund.</p>\n<p>Now, when Alice does some work worth 1 millidash, she asks Bob to create and sign a new version of the refund transaction.  Version two of the transaction spends 1 millidash to Alice and the other 99 back to Bob; it does not have a locktime, so Alice can sign it and spend it whenever she wants.  (But she doesn&#x27;t do that immediately.)</p>\n<p>Alice and Bob repeat these work-and-pay steps until Alice finishes for the day, or until the time lock is about to expire.  Alice signs the final version of the refund transaction and broadcasts it, paying herself and refunding any remaining balance to Bob.  The next day, when Alice starts work, they create a new micropayment channel.</p>\n<p>If Alice fails to broadcast a version of the refund transaction before its time lock expires, Bob can broadcast the first version and receive a full refund. This is one reason micropayment channels are best suited to small payments---if Alice&#x27;s Internet service goes out for a few hours near the time lock expiry, she could be cheated out of her payment.</p>\n<p>Transaction malleability, discussed in the <a href=\"core-guide-transactions-transaction-malleability\" target=\"\" title=\"\">Transactions section</a>, is another reason to limit the value of micropayment channels. If someone uses transaction malleability to break the link between the two transactions, Alice could hold Bob&#x27;s 100 millidash hostage even if she hadn&#x27;t done any work.</p>\n<p>For larger payments, Dash transaction fees are very low as a percentage of the total transaction value, so it makes more sense to protect payments with immediately-broadcast separate transactions.</p>"
}