{
 "metadata": {
  "image": [],
  "title": "",
  "description": ""
 },
 "api": {
  "method": "get",
  "url": "",
  "auth": "required",
  "results": {
   "codes": [
    {
     "name": "",
     "code": "{}",
     "language": "json",
     "status": 200
    },
    {
     "name": "",
     "code": "{}",
     "language": "json",
     "status": 400
    }
   ]
  },
  "params": []
 },
 "next": {
  "description": "",
  "pages": []
 },
 "title": "dashd",
 "icon": "",
 "updates": [
  "63410d6789b02b00354548b9"
 ],
 "type": "basic",
 "slug": "dash-core-wallet-arguments-and-commands-dashd",
 "excerpt": "Dash Core daemon",
 "body": "# Usage\n\n**Start Dash Core Daemon**\n```bash \ndashd [options]\n```\n[block:callout]\n{\n  \"type\": \"warning\",\n  \"title\": \"Debug Options\",\n  \"body\": \"The following sections show all available options including debug options that are not normally displayed. To see only regular options, run `dashd --help`.\"\n}\n[/block]\n## Options:\n\n```text\n  -?\n       Print this help message and exit\n\n  -alertnotify=<cmd>\n       Execute command when an alert is raised (%s in cmd is replaced by\n       message)\n\n  -assumevalid=<hex>\n       If this block is in the chain assume that it and its ancestors are valid\n       and potentially skip their script verification (0 to verify all,\n       default:\n       000000000000000fd8af332029688d4ccb227f481efa6aff1d662358cc4f76c1,\n       testnet:\n       000000b572cdcda2a0135e45c88d428c4fec859939f0023a39bb9a83e8b4f550)\n\n  -blockfilterindex=<type>\n       Maintain an index of compact filters by block (default: 0, values:\n       basic). If <type> is not supplied or if <type> = 1, indexes for\n       all known types are enabled.\n\n  -blocknotify=<cmd>\n       Execute command when the best block changes (%s in cmd is replaced by\n       block hash)\n\n  -blockreconstructionextratxn=<n>\n       Extra transactions to keep in memory for compact block reconstructions\n       (default: 100)\n\n  -blocksdir=<dir>\n       Specify directory to hold blocks subdirectory for *.dat files (default:\n       <datadir>)\n\n  -blocksonly\n       Whether to reject transactions from network peers. Automatic broadcast\n       and rebroadcast of any transactions from inbound peers is\n       disabled, unless '-whitelistforcerelay' is '1', in which case\n       whitelisted peers' transactions will be relayed. RPC transactions\n       are not affected. (default: 0)\n\n  -conf=<file>\n       Specify path to read-only configuration file. Relative paths will be\n       prefixed by datadir location. (default: dash.conf)\n\n  -daemon\n       Run in the background as a daemon and accept commands\n\n  -datadir=<dir>\n       Specify data directory\n\n  -dbbatchsize\n       Maximum database write batch size in bytes (default: 16777216)\n\n  -dbcache=<n>\n       Maximum database cache size <n> MiB (4 to 16384, default: 300). In\n       addition, unused mempool memory is shared for this cache (see\n       -maxmempool).\n\n  -debuglogfile=<file>\n       Specify location of debug log file. Relative paths will be prefixed by a\n       net-specific datadir location. (-nodebuglogfile to disable;\n       default: debug.log)\n\n  -includeconf=<file>\n       Specify additional configuration file, relative to the -datadir path\n       (only useable from configuration file, not command line)\n\n  -loadblock=<file>\n       Imports blocks from external file on startup\n\n  -maxmempool=<n>\n       Keep the transaction memory pool below <n> megabytes (default: 300)\n\n  -maxorphantxsize=<n>\n       Maximum total size of all orphan transactions in megabytes (default: 10)\n\n  -maxrecsigsage=<n>\n       Number of seconds to keep LLMQ recovery sigs (default: 604800)\n\n  -mempoolexpiry=<n>\n       Do not keep transactions in the mempool longer than <n> hours (default:\n       336)\n\n  -minimumchainwork=<hex>\n       Minimum work assumed to exist on a valid chain in hex (default:\n       0000000000000000000000000000000000000000000079c96bdb79315818b358,\n       testnet:\n       00000000000000000000000000000000000000000000000002d68c333d26a1b3)\n\n  -par=<n>\n       Set the number of script verification threads (-16 to 15, 0 = auto, <0 =\n       leave that many cores free, default: 0)\n\n  -persistmempool\n       Whether to save the mempool on shutdown and load on restart (default: 1)\n\n  -pid=<file>\n       Specify pid file. Relative paths will be prefixed by a net-specific\n       datadir location. (default: dashd.pid)\n\n  -prune=<n>\n       Reduce storage requirements by enabling pruning (deleting) of old\n       blocks. This allows the pruneblockchain RPC to be called to\n       delete specific blocks, and enables automatic pruning of old\n       blocks if a target size in MiB is provided. This mode is\n       incompatible with -txindex, -rescan and -disablegovernance=false.\n       Warning: Reverting this setting requires re-downloading the\n       entire blockchain. (default: 0 = disable pruning blocks, 1 =\n       allow manual pruning via RPC, >945 = automatically prune block\n       files to stay under the specified target size in MiB)\n\n  -settings=<file>\n       Specify path to dynamic settings data file. Can be disabled with\n       -nosettings. File is written at runtime and not meant to be\n       edited by users (use dash.conf instead for custom settings).\n       Relative paths will be prefixed by datadir location. (default:\n       settings.json)\n\n  -syncmempool\n       Sync mempool from other nodes on start (default: 1)\n\n  -sysperms\n       Create new files with system default permissions, instead of umask 077\n       (only effective with disabled wallet functionality)\n\n  -version\n       Print version and exit\n```\n\n## Connection options:\n\n```text\n  -addnode=<ip>\n       Add a node to connect to and attempt to keep the connection open (see\n       the `addnode` RPC command help for more info). This option can be\n       specified multiple times to add multiple nodes.\n\n  -allowprivatenet\n       Allow RFC1918 addresses to be relayed and connected to (default: 0)\n\n  -asmap=<file>\n       Specify asn mapping used for bucketing of the peers (default:\n       ip_asn.map). Relative paths will be prefixed by the net-specific\n       datadir location.\n\n  -banscore=<n>\n       Threshold for disconnecting and discouraging misbehaving peers (default:\n       100)\n\n  -bantime=<n>\n       Default duration (in seconds) of manually configured bans (default:\n       86400)\n\n  -bind=<addr>\n       Bind to given address and always listen on it. Use [host]:port notation\n       for IPv6\n\n  -connect=<ip>\n       Connect only to the specified node; -noconnect disables automatic\n       connections (the rules for this peer are the same as for\n       -addnode). This option can be specified multiple times to connect\n       to multiple nodes.\n\n  -discover\n       Discover own IP addresses (default: 1 when listening and no -externalip\n       or -proxy)\n\n  -dns\n       Allow DNS lookups for -addnode, -seednode and -connect (default: 1)\n\n  -dnsseed\n       Query for peer addresses via DNS lookup, if low on addresses (default: 1\n       unless -connect used)\n\n  -enablebip61\n       Send reject messages per BIP61 (default: 1)\n\n  -externalip=<ip>\n       Specify your own public address\n\n  -forcednsseed\n       Always query for peer addresses via DNS lookup (default: 0)\n\n  -listen\n       Accept connections from outside (default: 1 if no -proxy or -connect)\n\n  -listenonion\n       Automatically create Tor hidden service (default: 1)\n\n  -maxconnections=<n>\n       Maintain at most <n> connections to peers (temporary service connections\n       excluded) (default: 125)\n\n  -maxreceivebuffer=<n>\n       Maximum per-connection receive buffer, <n>*1000 bytes (default: 5000)\n\n  -maxsendbuffer=<n>\n       Maximum per-connection send buffer, <n>*1000 bytes (default: 1000)\n\n  -maxtimeadjustment\n       Maximum allowed median peer time offset adjustment. Local perspective of\n       time may be influenced by peers forward or backward by this\n       amount. (default: 4200 seconds)\n\n  -maxuploadtarget=<n>\n       Tries to keep outbound traffic under the given target (in MiB per 24h),\n       0 = no limit (default: 0)\n\n  -natpmp\n       Use NAT-PMP to map the listening port (default: 0)\n\n  -onion=<ip:port>\n       Use separate SOCKS5 proxy to reach peers via Tor hidden services, set\n       -noonion to disable (default: -proxy)\n\n  -onlynet=<net>\n       Make outgoing connections only through network <net> (ipv4, ipv6 or\n       onion). Incoming connections are not affected by this option.\n       This option can be specified multiple times to allow multiple\n       networks.\n\n  -peerblockfilters\n       Serve compact block filters to peers per BIP 157 (default: 0)\n\n  -peerbloomfilters\n       Support filtering of blocks and transaction with bloom filters (default:\n       1)\n\n  -peertimeout=<n>\n       Specify p2p connection timeout in seconds. This option determines the\n       amount of time a peer may be inactive before the connection to it\n       is dropped. (minimum: 1, default: 60)\n\n  -permitbaremultisig\n       Relay non-P2SH multisig (default: 1)\n\n  -port=<port>\n       Listen for connections on <port> (default: 9999, testnet: 19999,\n       regtest: 19899)\n\n  -proxy=<ip:port>\n       Connect through SOCKS5 proxy, set -noproxy to disable (default:\n       disabled)\n\n  -proxyrandomize\n       Randomize credentials for every proxy connection. This enables Tor\n       stream isolation (default: 1)\n\n  -seednode=<ip>\n       Connect to a node to retrieve peer addresses, and disconnect. This\n       option can be specified multiple times to connect to multiple\n       nodes.\n\n  -socketevents=<mode>\n       Socket events mode, which must be one of 'select', 'poll', 'epoll' or\n       'kqueue', depending on your system (default: Linux - 'epoll',\n       FreeBSD/Apple - 'kqueue', Windows - 'select')\n\n  -timeout=<n>\n       Specify connection timeout in milliseconds (minimum: 1, default: 5000)\n\n  -torcontrol=<ip>:<port>\n       Tor control port to use if onion listening enabled (default:\n       127.0.0.1:9051)\n\n  -torpassword=<pass>\n       Tor control port password (default: empty)\n\n  -upnp\n       Use UPnP to map the listening port (default: 0)\n\n  -whitebind=<[permissions@]addr>\n       Bind to given address and whitelist peers connecting to it. Use\n       [host]:port notation for IPv6. Allowed permissions are\n       bloomfilter (allow requesting BIP37 filtered blocks and\n       transactions), noban (do not ban for misbehavior), forcerelay\n       (relay even non-standard transactions), relay (relay even in\n       -blocksonly mode), and mempool (allow requesting BIP35 mempool\n       contents). Specify multiple permissions separated by commas\n       (default: noban,mempool,relay). Can be specified multiple times.\n\n  -whitelist=<[permissions@]IP address or network>\n       Whitelist peers connecting from the given IP address (e.g. 1.2.3.4) or\n       CIDR notated network(e.g. 1.2.3.0/24). Uses same permissions as\n       -whitebind. Can be specified multiple times.\n```\n\n## Indexing options:\n\n```text\n  -addressindex\n       Maintain a full address index, used to query for the balance, txids and\n       unspent outputs for addresses (default: 0)\n\n  -reindex\n       Rebuild chain state and block index from the blk*.dat files on disk\n\n  -reindex-chainstate\n       Rebuild chain state from the currently indexed blocks. When in pruning\n       mode or if blocks on disk might be corrupted, use full -reindex\n       instead.\n\n  -spentindex\n       Maintain a full spent index, used to query the spending txid and input\n       index for an outpoint (default: 0)\n\n  -timestampindex\n       Maintain a timestamp index for block hashes, used to query blocks hashes\n       by a range of timestamps (default: 0)\n\n  -txindex\n       Maintain a full transaction index, used by the getrawtransaction rpc\n       call (default: 1)\n```\n\n## Wallet options:\n\n> 🚧 zapwallettxes\n>\n> Dash Core 18.1.0 removed the `-zapwallettxes` startup option and its functionality. This option was originally intended to allow for the fee bumping of transactions that did not signal RBF. This functionality has been superseded with the [abandon transaction capability](core-api-ref-remote-procedure-calls-wallet#abandontransaction) available via RPC/console or when right-clicking on unconfirmed transactions in Dash-Qt.\n\n```text\n  -avoidpartialspends\n       Group outputs by address, selecting all or none, instead of selecting on\n       a per-output basis. Privacy is improved as an address is only\n       used once (unless someone sends to it after spending from it),\n       but may result in slightly higher fees as suboptimal coin\n       selection may result due to the added limitation (default: 0\n       (always enabled for wallets with \"avoid_reuse\" enabled))\n\n  -createwalletbackups=<n>\n       Number of automatic wallet backups (default: 10)\n\n  -disablewallet\n       Do not load the wallet and disable wallet RPC calls\n\n  -instantsendnotify=<cmd>\n       Execute command when a wallet InstantSend transaction is successfully\n       locked (%s in cmd is replaced by TxID)\n\n  -keypool=<n>\n       Set key pool size to <n> (default: 1000)\n\n  -rescan=<mode>\n       Rescan the block chain for missing wallet transactions on startup (1 =\n       start from wallet creation time, 2 = start from genesis block)\n\n  -spendzeroconfchange\n       Spend unconfirmed change when sending transactions (default: 1)\n\n  -upgradewallet\n       Upgrade wallet to latest format on startup\n\n  -wallet=<path>\n       Specify wallet database path. Can be specified multiple times to load\n       multiple wallets. Path is interpreted relative to <walletdir> if\n       it is not absolute, and will be created if it does not exist (as\n       a directory containing a wallet.dat file and log files). For\n       backwards compatibility this will also accept names of existing\n       data files in <walletdir>.)\n\n  -walletbackupsdir=<dir>\n       Specify full path to directory for automatic wallet backups (must exist)\n\n  -walletbroadcast\n       Make the wallet broadcast transactions (default: 1)\n\n  -walletdir=<dir>\n       Specify directory to hold wallets (default: <datadir>/wallets if it\n       exists, otherwise <datadir>)\n\n  -walletnotify=<cmd>\n       Execute command when a wallet transaction changes (%s in cmd is replaced\n       by TxID)\n```\n\n## Wallet fee options:\n\n```text\n  -discardfee=<amt>\n       The fee rate (in DASH/kB) that indicates your tolerance for discarding\n       change by adding it to the fee (default: 0.0001). Note: An output\n       is discarded if it is dust at this rate, but we will always\n       discard up to the dust relay fee and a discard fee above that is\n       limited by the fee estimate for the longest target\n\n  -fallbackfee=<amt>\n       A fee rate (in DASH/kB) that will be used when fee estimation has\n       insufficient data (default: 0.00001)\n\n  -mintxfee=<amt>\n       Fees (in DASH/kB) smaller than this are considered zero fee for\n       transaction creation (default: 0.00001)\n\n  -paytxfee=<amt>\n       Fee (in DASH/kB) to add to transactions you send (default: 0.00)\n\n  -txconfirmtarget=<n>\n       If paytxfee is not set, include enough fee so transactions begin\n       confirmation on average within n blocks (default: 6)\n```\n\n## HD wallet options:\n\n```text\n  -hdseed=<hex>\n       User defined seed for HD wallet (should be in hex). Only has effect\n       during wallet creation/first start (default: randomly generated)\n\n  -mnemonic=<text>\n       User defined mnemonic for HD wallet (bip39). Only has effect during\n       wallet creation/first start (default: randomly generated)\n\n  -mnemonicpassphrase=<text>\n       User defined mnemonic passphrase for HD wallet (BIP39). Only has effect\n       during wallet creation/first start (default: empty string)\n\n  -usehd\n       Use hierarchical deterministic key generation (HD) after BIP39/BIP44.\n       Only has effect during wallet creation/first start (default: 0)\n```\n\n## CoinJoin options:\n\n```\n  -coinjoinamount=<n>\n       Target CoinJoin balance (2-21000000, default: 1000)\n\n  -coinjoinautostart\n       Start CoinJoin automatically (0-1, default: 0)\n\n  -coinjoindenomsgoal=<n>\n       Try to create at least N inputs of each denominated amount (10-100000,\n       default: 50)\n\n  -coinjoindenomshardcap=<n>\n       Create up to N inputs of each denominated amount (10-100000, default:\n       300)\n\n  -coinjoinmultisession\n       Enable multiple CoinJoin mixing sessions per block, experimental (0-1,\n       default: 0)\n\n  -coinjoinrounds=<n>\n       Use N separate masternodes for each denominated input to mix funds\n       (2-16, default: 4)\n\n  -coinjoinsessions=<n>\n       Use N separate masternodes in parallel to mix funds (1-10, default: 4)\n\n  -enablecoinjoin\n       Enable use of CoinJoin for funds stored in this wallet (0-1, default: 0)\n```\n\n## ZeroMQ notification options:\n\n```\n  -zmqpubhashblock=<address>\n       Enable publish hash block in <address>\n\n  -zmqpubhashblockhwm=<n>\n       Set publish hash block outbound message high water mark (default: 1000)\n\n  -zmqpubhashchainlock=<address>\n       Enable publish hash block (locked via ChainLocks) in <address>\n\n  -zmqpubhashchainlockhwm=<n>\n       Set publish hash chain lock outbound message high water mark (default:\n       1000)\n\n  -zmqpubhashgovernanceobject=<address>\n       Enable publish hash of governance objects (like proposals) in <address>\n\n  -zmqpubhashgovernanceobjecthwm=<n>\n       Set publish hash governance object outbound message high water mark\n       (default: 1000)\n\n  -zmqpubhashgovernancevote=<address>\n       Enable publish hash of governance votes in <address>\n\n  -zmqpubhashgovernancevotehwm=<n>\n       Set publish hash governance vote outbound message high water mark\n       (default: 1000)\n\n  -zmqpubhashinstantsenddoublespend=<address>\n       Enable publish transaction hashes of attempted InstantSend double spend\n       in <address>\n\n  -zmqpubhashinstantsenddoublespendhwm=<n>\n       Set publish hash InstantSend double spend outbound message high water\n       mark (default: 1000)\n\n  -zmqpubhashrecoveredsig=<address>\n       Enable publish message hash of recovered signatures (recovered by LLMQs)\n       in <address>\n\n  -zmqpubhashrecoveredsighwm=<n>\n       Set publish hash recovered signature outbound message high water mark\n       (default: 1000)\n\n  -zmqpubhashtx=<address>\n       Enable publish hash transaction in <address>\n\n  -zmqpubhashtxhwm=<n>\n       Set publish hash transaction outbound message high water mark (default:\n       1000)\n\n  -zmqpubhashtxlock=<address>\n       Enable publish hash transaction (locked via InstantSend) in <address>\n\n  -zmqpubhashtxlockhwm=<n>\n       Set publish hash transaction lock outbound message high water mark\n       (default: 1000)\n\n  -zmqpubrawblock=<address>\n       Enable publish raw block in <address>\n\n  -zmqpubrawblockhwm=<n>\n       Set publish raw block outbound message high water mark (default: 1000)\n\n  -zmqpubrawchainlock=<address>\n       Enable publish raw block (locked via ChainLocks) in <address>\n\n  -zmqpubrawchainlockhwm=<n>\n       Set publish raw chain lock outbound message high water mark (default:\n       1000)\n\n  -zmqpubrawchainlocksig=<address>\n       Enable publish raw block (locked via ChainLocks) and CLSIG message in\n       <address>\n\n  -zmqpubrawchainlocksighwm=<n>\n       Set publish raw chain lock signature outbound message high water mark\n       (default: 1000)\n\n  -zmqpubrawgovernanceobject=<address>\n       Enable publish raw governance votes in <address>\n\n  -zmqpubrawgovernanceobjecthwm=<n>\n       Set publish raw governance object outbound message high water mark\n       (default: 1000)\n\n  -zmqpubrawgovernancevote=<address>\n       Enable publish raw governance objects (like proposals) in <address>\n\n  -zmqpubrawgovernancevotehwm=<n>\n       Set publish raw governance vote outbound message high water mark\n       (default: 1000)\n\n  -zmqpubrawinstantsenddoublespend=<address>\n       Enable publish raw transactions of attempted InstantSend double spend in\n       <address>\n\n  -zmqpubrawinstantsenddoublespendhwm=<n>\n       Set publish raw InstantSend double spend outbound message high water\n       mark (default: 1000)\n\n  -zmqpubrawrecoveredsig=<address>\n       Enable publish raw recovered signatures (recovered by LLMQs) in\n       <address>\n\n  -zmqpubrawrecoveredsighwm=<n>\n       Set publish raw recovered signature outbound message high water mark\n       (default: 1000)\n\n  -zmqpubrawtx=<address>\n       Enable publish raw transaction in <address>\n\n  -zmqpubrawtxhwm=<n>\n       Set publish raw transaction outbound message high water mark (default:\n       1000)\n\n  -zmqpubrawtxlock=<address>\n       Enable publish raw transaction (locked via InstantSend) in <address>\n\n  -zmqpubrawtxlockhwm=<n>\n       Set publish raw transaction lock outbound message high water mark\n       (default: 1000)\n\n  -zmqpubrawtxlocksig=<address>\n       Enable publish raw transaction (locked via InstantSend) and ISLOCK in\n       <address>\n\n  -zmqpubrawtxlocksighwm=<n>\n       Set publish raw transaction lock signature outbound message high water\n       mark (default: 1000)\n```\n\n## Debugging/Testing options:\n\n```\n  -addrmantest\n       Allows to test address relay on localhost\n\n  -checkblockindex\n       Do a consistency check for the block tree, and  occasionally. (default:\n       0, regtest: 1)\n\n  -checkblocks=<n>\n       How many blocks to check at startup (default: 6, 0 = all)\n\n  -checklevel=<n>\n       How thorough the block verification of -checkblocks is: level 0 reads\n       the blocks from disk, level 1 verifies block validity, level 2\n       verifies undo data, level 3 checks disconnection of tip blocks,\n       and level 4 tries to reconnect the blocks, each level includes\n       the checks of the previous levels (0-4, default: 3)\n\n  -checkmempool=<n>\n       Run checks every <n> transactions (default: 0, regtest: 1)\n\n  -checkpoints\n       Enable rejection of any forks from the known historical chain until\n       block 1450000 (default: 1)\n\n  -debug=<category>\n       Output debugging information (default: -nodebug, supplying <category> is\n       optional). If <category> is not supplied or if <category> = 1,\n       output all debugging information. <category> can be: net, tor,\n       mempool, http, bench, zmq, walletdb, rpc, estimatefee, addrman,\n       selectcoins, reindex, cmpctblock, rand, prune, proxy, mempoolrej,\n       libevent, coindb, qt, leveldb, chainlocks, gobject, instantsend,\n       llmq, llmq-dkg, llmq-sigs, mnpayments, mnsync, coinjoin, spork,\n       netconn.\n\n  -debugexclude=<category>\n       Exclude debugging information for a category. Can be used in conjunction\n       with -debug=1 to output debug logs for all categories except one\n       or more specified categories.\n\n  -deprecatedrpc=<method>\n       Allows deprecated RPC method(s) to be used\n\n  -disablegovernance\n       Disable governance validation (0-1, default: 0)\n\n  -dropmessagestest=<n>\n       Randomly drop 1 of every <n> network messages\n\n  -help-debug\n       Print help message with debugging options and exit\n\n  -limitancestorcount=<n>\n       Do not accept transactions if number of in-mempool ancestors is <n> or\n       more (default: 25)\n\n  -limitancestorsize=<n>\n       Do not accept transactions whose size with all in-mempool ancestors\n       exceeds <n> kilobytes (default: 101)\n\n  -limitdescendantcount=<n>\n       Do not accept transactions if any ancestor would have <n> or more\n       in-mempool descendants (default: 25)\n\n  -limitdescendantsize=<n>\n       Do not accept transactions if any ancestor would have more than <n>\n       kilobytes of in-mempool descendants (default: 101).\n\n  -logips\n       Include IP addresses in debug output (default: 0)\n\n  -logthreadnames\n       Prepend debug output with name of the originating thread (only available\n       on platforms supporting thread_local) (default: 0)\n\n  -logtimemicros\n       Add microsecond precision to debug timestamps (default: 0)\n\n  -logtimestamps\n       Prepend debug output with timestamp (default: 1)\n\n  -maxsigcachesize=<n>\n       Limit sum of signature cache and script execution cache sizes to <n> MiB\n       (default: 32)\n\n  -maxtipage=<n>\n       Maximum tip age in seconds to consider node in initial block download\n       (default: 21600)\n\n  -maxtxfee=<amt>\n       Maximum total fees (in DASH) to use in a single wallet transaction;\n       setting this too low may abort large transactions (default: 0.10)\n\n  -minsporkkeys=<n>\n       Overrides minimum spork signers to change spork value. Only useful for\n       regtest and devnet. Using this on mainnet or testnet will ban\n       you.\n\n  -mocktime=<n>\n       Replace actual time with UNIX epoch time(default: 0)\n\n  -printpriority\n       Log transaction fee per kB when mining blocks (default: 0)\n\n  -printtoconsole\n       Send trace/debug info to console (default: 1 when no -daemon. To disable\n       logging to file, set -nodebuglogfile)\n\n  -pushversion\n       Protocol version to report to other nodes\n\n  -shrinkdebugfile\n       Shrink debug.log file on client startup (default: 1 when no -debug)\n\n  -sporkaddr=<dashaddress>\n       Override spork address. Only useful for regtest and devnet. Using this\n       on mainnet or testnet will ban you.\n\n  -sporkkey=<privatekey>\n       Set the private key to be used for signing spork messages.\n\n  -stopafterblockimport\n       Stop running after importing blocks from disk (default: 0)\n\n  -stopatheight\n       Stop running after reaching the given height in the main chain (default:\n       0)\n\n  -uacomment=<cmt>\n       Append comment to the user agent string\n\n  -watchquorums=<n>\n       Watch and validate quorum communication (default: 0)\n```\n\n## Chain selection options:\n\n```\n  -budgetparams=<masternode>:<budget>:<superblock>\n       Override masternode, budget and superblock start heights (regtest-only)\n\n  -devnet=<name>\n       Use devnet chain with provided name\n\n  -dip3params=<activation>:<enforcement>\n       Override DIP3 activation and enforcement heights (regtest-only)\n\n  -dip8params=<activation>\n       Override DIP8 activation height (regtest-only)\n\n  -highsubsidyblocks=<n>\n       The number of blocks with a higher than normal subsidy to mine at the\n       start of a chain (default: 0, devnet-only)\n\n  -highsubsidyfactor=<n>\n       The factor to multiply the normal block subsidy by while in the\n       highsubsidyblocks window of a chain (default: 1, devnet-only)\n\n  -llmqchainlocks=<quorum name>\n       Override the default LLMQ type used for ChainLocks. Allows using\n       ChainLocks with smaller LLMQs. (default: llmq_50_60, devnet-only)\n\n  -llmqdevnetparams=<size>:<threshold>\n       Override the default LLMQ size for the LLMQ_DEVNET quorum (default: 3:2,\n       devnet-only)\n\n  -llmqinstantsend=<quorum name>\n       Override the default LLMQ type used for InstantSend. Allows using\n       InstantSend with smaller LLMQs. (default: llmq_50_60,\n       devnet-only)\n\n  -llmqinstantsenddip0024=<quorum name>\n       Override the default LLMQ type used for InstantSendDIP0024. (default:\n       llmq_60_75, devnet-only)\n\n  -llmqtestinstantsendparams=<size>:<threshold>\n       Override the default LLMQ size for the LLMQ_TEST_INSTANTSEND quorums\n       (default: 3:2, regtest-only)\n\n  -llmqtestparams=<size>:<threshold>\n       Override the default LLMQ size for the LLMQ_TEST quorum (default: 3:2,\n       regtest-only)\n\n  -minimumdifficultyblocks=<n>\n       The number of blocks that can be mined with the minimum difficulty at\n       the start of a chain (default: 0, devnet-only)\n\n  -powtargetspacing=<n>\n       Override the default PowTargetSpacing value in seconds (default: 2.5\n       minutes, devnet-only)\n\n  -regtest\n       Enter regression test mode, which uses a special chain in which blocks\n       can be solved instantly. This is intended for regression testing\n       tools and app development.\n\n  -testnet\n       Use the test chain\n\n  -vbparams=<deployment>:<start>:<end>(:<window>:<threshold/thresholdstart>(:<thresholdmin>:<falloffcoeff>))\n       Use given start/end times for specified version bits deployment\n       (regtest-only). Specifying window, threshold/thresholdstart,\n       thresholdmin and falloffcoeff is optional.\n```\n\n## Masternode options:\n\n```\n  -llmq-data-recovery=<n>\n       Enable automated quorum data recovery (default: 1)\n\n  -llmq-qvvec-sync=<quorum_name>:<mode>\n       Defines from which LLMQ type the masternode should sync quorum\n       verification vectors. Can be used multiple times with different\n       LLMQ types. <mode>: 0 (sync always from all quorums of the type\n       defined by <quorum_name>), 1 (sync from all quorums of the type\n       defined by <quorum_name> if a member of any of the quorums)\n\n  -masternodeblsprivkey=<hex>\n       Set the masternode BLS private key and enable the client to act as a\n       masternode\n\n  -platform-user=<user>\n       Set the username for the \"platform user\", a restricted user intended to\n       be used by Dash Platform, to the specified username.\n```\n\n## Node relay options:\n\n```\n  -acceptnonstdtxn\n       Relay and mine \"non-standard\" transactions (testnet/regtest only;\n       default: 1)\n\n  -bytespersigop\n       Equivalent bytes per sigop in transactions for relay and mining\n       (default: 20)\n\n  -datacarrier\n       Relay and mine data carrier transactions (default: 1)\n\n  -datacarriersize\n       Maximum size of data in data carrier transactions we relay and mine\n       (default: 83)\n\n  -dustrelayfee=<amt>\n       Fee rate (in DASH/kB) used to define dust, the value of an output such\n       that it will cost more than its value in fees at this fee rate to\n       spend it. (default: 0.00003)\n\n  -incrementalrelayfee=<amt>\n       Fee rate (in DASH/kB) used to define cost of relay, used for mempool\n       limiting and BIP 125 replacement. (default: 0.00001)\n\n  -minrelaytxfee=<amt>\n       Fees (in DASH/kB) smaller than this are considered zero fee for\n       relaying, mining and transaction creation (default: 0.00001)\n\n  -whitelistforcerelay\n       Add 'forcerelay' permission to whitelisted inbound peers with default\n       permissions. This will relay transactions even if the\n       transactions were already in the mempool or violate local relay\n       policy. (default: 0)\n\n  -whitelistrelay\n       Add 'relay' permission to whitelisted inbound peers with default\n       permissions. This will accept relayed transactions even when not\n       relaying transactions (default: 1)\n```\n\n## Block creation options:\n\n```\n  -blockmaxsize=<n>\n       Set maximum block size in bytes (default: 2000000)\n\n  -blockmintxfee=<amt>\n       Set lowest fee rate (in DASH/kB) for transactions to be included in\n       block creation. (default: 0.00001)\n\n  -blockversion=<n>\n       Override block version to test forking scenarios\n```\n\n## RPC server options:\n\n```\n  -rest\n       Accept public REST requests (default: 0)\n\n  -rpcallowip=<ip>\n       Allow JSON-RPC connections from specified source. Valid for <ip> are a\n       single IP (e.g. 1.2.3.4), a network/netmask (e.g.\n       1.2.3.4/255.255.255.0) or a network/CIDR (e.g. 1.2.3.4/24). This\n       option can be specified multiple times\n\n  -rpcauth=<userpw>\n       Username and HMAC-SHA-256 hashed password for JSON-RPC connections. The\n       field <userpw> comes in the format: <USERNAME>:<SALT>$<HASH>. A\n       canonical python script is included in share/rpcuser. The client\n       then connects normally using the\n       rpcuser=<USERNAME>/rpcpassword=<PASSWORD> pair of arguments. This\n       option can be specified multiple times\n\n  -rpcbind=<addr>[:port]\n       Bind to given address to listen for JSON-RPC connections. Do not expose\n       the RPC server to untrusted networks such as the public internet!\n       This option is ignored unless -rpcallowip is also passed. Port is\n       optional and overrides -rpcport. Use [host]:port notation for\n       IPv6. This option can be specified multiple times (default:\n       127.0.0.1 and ::1 i.e., localhost, or if -rpcallowip has been\n       specified, 0.0.0.0 and :: i.e., all addresses)\n\n  -rpccookiefile=<loc>\n       Location of the auth cookie. Relative paths will be prefixed by a\n       net-specific datadir location. (default: data dir)\n\n  -rpcpassword=<pw>\n       Password for JSON-RPC connections\n\n  -rpcport=<port>\n       Listen for JSON-RPC connections on <port> (default: 9998, testnet:\n       19998, regtest: 19898)\n\n  -rpcservertimeout=<n>\n       Timeout during HTTP requests (default: 30)\n\n  -rpcthreads=<n>\n       Set the number of threads to service RPC calls (default: 4)\n\n  -rpcuser=<user>\n       Username for JSON-RPC connections\n\n  -rpcwhitelist=<whitelist>\n       Set a whitelist to filter incoming RPC calls for a specific user. The\n       field <whitelist> comes in the format: <USERNAME>:<rpc 1>,<rpc\n       2>,...,<rpc n>. If multiple whitelists are set for a given user,\n       they are set-intersected. See -rpcwhitelistdefault documentation\n       for information on default whitelist behavior.\n\n  -rpcwhitelistdefault\n       Sets default behavior for rpc whitelisting. Unless rpcwhitelistdefault\n       is set to 0, if any -rpcwhitelist is set, the rpc server acts as\n       if all rpc users are subject to empty-unless-otherwise-specified\n       whitelists. If rpcwhitelistdefault is set to 1 and no\n       -rpcwhitelist is set, rpc server acts as if all rpc users are\n       subject to empty whitelists.\n\n  -rpcworkqueue=<n>\n       Set the depth of the work queue to service RPC calls (default: 16)\n\n  -server\n       Accept command line and JSON-RPC commands\n```\n\n## Statsd options:\n\n```text\n  -statsenabled\n       Publish internal stats to statsd (default: 0)\n\n  -statshost=<ip>\n       Specify statsd host (default: 127.0.0.1)\n\n  -statshostname=<ip>\n       Specify statsd host name (default: )\n\n  -statsns=<ns>\n       Specify additional namespace prefix (default: )\n\n  -statsperiod=<seconds>\n       Specify the number of seconds between periodic measurements (default:\n       60)\n\n  -statsport=<port>\n       Specify statsd port (default: 8125)\n```\n\n## Wallet debugging/testing options:\n[block:callout]\n{\n  \"type\": \"warning\",\n  \"body\": \"These options are normally hidden and will only be shown if using the help debug option: `dashd --held -help-debug`\"\n}\n[/block]\n```text\n  -dblogsize=<n>\n       Flush wallet database activity from memory to disk log every <n>\n       megabytes (default: 100)\n\n  -flushwallet\n       Run a thread to flush wallet periodically (default: 1)\n\n  -privdb\n       Sets the DB_PRIVATE flag in the wallet db environment (default: 1)\n\n  -walletrejectlongchains\n       Wallet will not create transactions that violate mempool chain limits\n       (default: 0)\n```\n\n# Network Dependent Options\n\nThe following options can only be used for specific network types. These options are provided support development (devnet) and regression test (regtest) networks.\n\n## Devnet Options\n\n```text\n  -highsubsidyblocks=<n>\n       The number of blocks with a higher than normal subsidy to mine at the\n       start of a chain (default: 0, devnet-only)\n\n  -highsubsidyfactor=<n>\n       The factor to multiply the normal block subsidy by while in the\n       highsubsidyblocks window of a chain (default: 1, devnet-only)\n\n  -llmqchainlocks=<quorum name>\n       Override the default LLMQ type used for ChainLocks. Allows using\n       ChainLocks with smaller LLMQs. (default: llmq_50_60, devnet-only)\n\n  -llmqdevnetparams=<size>:<threshold>\n       Override the default LLMQ size for the LLMQ_DEVNET quorum (default: 3:2,\n       devnet-only)\n\n  -llmqinstantsend=<quorum name>\n       Override the default LLMQ type used for InstantSend. Allows using\n       InstantSend with smaller LLMQs. (default: llmq_50_60,\n       devnet-only)\n\n  -llmqinstantsenddip0024=<quorum name>\n       Override the default LLMQ type used for InstantSendDIP0024. (default:\n       llmq_60_75, devnet-only)\n\n  -minimumdifficultyblocks=<n>\n       The number of blocks that can be mined with the minimum difficulty at\n       the start of a chain (default: 0, devnet-only)\n\n  -powtargetspacing=<n>\n       Override the default PowTargetSpacing value in seconds (default: 2.5\n       minutes, devnet-only)\n```\n\nThe quorum names used in these options are:\n\n| LLMQ Type | LLMQ Name |\n| :-: | - |\n| 1 | llmq50_60 |\n| 2 | llmq400_60 |\n| 3 | llmq400_85 |\n| 4 | llmq100_67 |\n| 5 | llmq60_75 |\n| 100 | llmq_test |\n| 101 | llmq_devnet |\n\nRefer to [this table in DIP-6 - LLMQs](https://github.com/dashpay/dips/blob/master/dip-0006.md#current-llmq-types) for details on each quorum type.\n\n## Regtest Options\n\n```\n  -budgetparams=<masternode>:<budget>:<superblock>\n       Override masternode, budget and superblock start heights (regtest-only)\n\n  -dip3params=<activation>:<enforcement>\n       Override DIP3 activation and enforcement heights (regtest-only)\n\n  -dip8params=<activation>\n       Override DIP8 activation height (regtest-only)\n\n  -llmqtestinstantsendparams=<size>:<threshold>\n       Override the default LLMQ size for the LLMQ_TEST_INSTANTSEND quorums\n       (default: 3:2, regtest-only)\n\n  -llmqtestparams=<size>:<threshold>\n       Override the default LLMQ size for the LLMQ_TEST quorum (default: 3:2,\n       regtest-only)\n\n  -vbparams=<deployment>:<start>:<end>(:<window>:<threshold/thresholdstart>(:<thresholdmin>:<falloffcoeff>))\n       Use given start/end times for specified version bits deployment\n       (regtest-only). Specifying window, threshold/thresholdstart,\n       thresholdmin and falloffcoeff is optional.\n```",
 "order": 0,
 "isReference": false,
 "deprecated": false,
 "hidden": false,
 "sync_unique": "",
 "link_url": "",
 "link_external": false,
 "pendingAlgoliaPublish": false,
 "previousSlug": "",
 "slugUpdatedAt": "2020-10-06T18:01:01.457Z",
 "revision": 5,
 "_id": "63458bb285735b0012a24fe3",
 "parentDoc": "63458bb285735b0012a24fe0",
 "createdAt": "2020-06-04T14:35:10.463Z",
 "updatedAt": "2022-10-19T21:11:18.505Z",
 "user": "5b8400d7185d5e00036dcc3b",
 "category": "63458bb285735b0012a24f64",
 "project": "5daf2e65f4109c0040fd51e1",
 "version": "63458bb285735b0012a24fea",
 "__v": 1,
 "isApi": false,
 "id": "63458bb285735b0012a24fe3",
 "body_html": "<div class=\"magic-block-textarea\"><h1 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-usage\"></div>Usage<a class=\"fa fa-anchor\" href=\"#section-usage\"></a></h1>\n<p><strong>Start Dash Core Daemon</strong></p>\n<pre><code class=\"lang-bash\"><span class='cm-s-neo'>dashd [options]</span>\n</code></pre>\n\n</div>\n<div class=\"magic-block-callout type-warning \">\n\t<h3><i title=\"Warning\" class=\"fa fa-exclamation-circle\"></i>Debug Options\n\t</h3>\n\t<div class=\"callout-body\"><p>The following sections show all available options including debug options that are not normally displayed. To see only regular options, run <code>dashd --help</code>.</p>\n\n\t</div>\n</div>\n<div class=\"magic-block-textarea\"><h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-options\"></div>Options:<a class=\"fa fa-anchor\" href=\"#section-options\"></a></h2>\n<pre><code class=\"lang-text\">  -?\n       Print this help message and exit\n\n  -alertnotify=&lt;cmd&gt;\n       Execute command when an alert is raised (%s in cmd is replaced by\n       message)\n\n  -assumevalid=&lt;hex&gt;\n       If this block is in the chain assume that it and its ancestors are valid\n       and potentially skip their script verification (0 to verify all,\n       default:\n       000000000000000fd8af332029688d4ccb227f481efa6aff1d662358cc4f76c1,\n       testnet:\n       000000b572cdcda2a0135e45c88d428c4fec859939f0023a39bb9a83e8b4f550)\n\n  -blockfilterindex=&lt;type&gt;\n       Maintain an index of compact filters by block (default: 0, values:\n       basic). If &lt;type&gt; is not supplied or if &lt;type&gt; = 1, indexes for\n       all known types are enabled.\n\n  -blocknotify=&lt;cmd&gt;\n       Execute command when the best block changes (%s in cmd is replaced by\n       block hash)\n\n  -blockreconstructionextratxn=&lt;n&gt;\n       Extra transactions to keep in memory for compact block reconstructions\n       (default: 100)\n\n  -blocksdir=&lt;dir&gt;\n       Specify directory to hold blocks subdirectory for *.dat files (default:\n       &lt;datadir&gt;)\n\n  -blocksonly\n       Whether to reject transactions from network peers. Automatic broadcast\n       and rebroadcast of any transactions from inbound peers is\n       disabled, unless &#39;-whitelistforcerelay&#39; is &#39;1&#39;, in which case\n       whitelisted peers&#39; transactions will be relayed. RPC transactions\n       are not affected. (default: 0)\n\n  -conf=&lt;file&gt;\n       Specify path to read-only configuration file. Relative paths will be\n       prefixed by datadir location. (default: dash.conf)\n\n  -daemon\n       Run in the background as a daemon and accept commands\n\n  -datadir=&lt;dir&gt;\n       Specify data directory\n\n  -dbbatchsize\n       Maximum database write batch size in bytes (default: 16777216)\n\n  -dbcache=&lt;n&gt;\n       Maximum database cache size &lt;n&gt; MiB (4 to 16384, default: 300). In\n       addition, unused mempool memory is shared for this cache (see\n       -maxmempool).\n\n  -debuglogfile=&lt;file&gt;\n       Specify location of debug log file. Relative paths will be prefixed by a\n       net-specific datadir location. (-nodebuglogfile to disable;\n       default: debug.log)\n\n  -includeconf=&lt;file&gt;\n       Specify additional configuration file, relative to the -datadir path\n       (only useable from configuration file, not command line)\n\n  -loadblock=&lt;file&gt;\n       Imports blocks from external file on startup\n\n  -maxmempool=&lt;n&gt;\n       Keep the transaction memory pool below &lt;n&gt; megabytes (default: 300)\n\n  -maxorphantxsize=&lt;n&gt;\n       Maximum total size of all orphan transactions in megabytes (default: 10)\n\n  -maxrecsigsage=&lt;n&gt;\n       Number of seconds to keep LLMQ recovery sigs (default: 604800)\n\n  -mempoolexpiry=&lt;n&gt;\n       Do not keep transactions in the mempool longer than &lt;n&gt; hours (default:\n       336)\n\n  -minimumchainwork=&lt;hex&gt;\n       Minimum work assumed to exist on a valid chain in hex (default:\n       0000000000000000000000000000000000000000000079c96bdb79315818b358,\n       testnet:\n       00000000000000000000000000000000000000000000000002d68c333d26a1b3)\n\n  -par=&lt;n&gt;\n       Set the number of script verification threads (-16 to 15, 0 = auto, &lt;0 =\n       leave that many cores free, default: 0)\n\n  -persistmempool\n       Whether to save the mempool on shutdown and load on restart (default: 1)\n\n  -pid=&lt;file&gt;\n       Specify pid file. Relative paths will be prefixed by a net-specific\n       datadir location. (default: dashd.pid)\n\n  -prune=&lt;n&gt;\n       Reduce storage requirements by enabling pruning (deleting) of old\n       blocks. This allows the pruneblockchain RPC to be called to\n       delete specific blocks, and enables automatic pruning of old\n       blocks if a target size in MiB is provided. This mode is\n       incompatible with -txindex, -rescan and -disablegovernance=false.\n       Warning: Reverting this setting requires re-downloading the\n       entire blockchain. (default: 0 = disable pruning blocks, 1 =\n       allow manual pruning via RPC, &gt;945 = automatically prune block\n       files to stay under the specified target size in MiB)\n\n  -settings=&lt;file&gt;\n       Specify path to dynamic settings data file. Can be disabled with\n       -nosettings. File is written at runtime and not meant to be\n       edited by users (use dash.conf instead for custom settings).\n       Relative paths will be prefixed by datadir location. (default:\n       settings.json)\n\n  -syncmempool\n       Sync mempool from other nodes on start (default: 1)\n\n  -sysperms\n       Create new files with system default permissions, instead of umask 077\n       (only effective with disabled wallet functionality)\n\n  -version\n       Print version and exit\n</code></pre>\n<h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-connection-options\"></div>Connection options:<a class=\"fa fa-anchor\" href=\"#section-connection-options\"></a></h2>\n<pre><code class=\"lang-text\">  -addnode=&lt;ip&gt;\n       Add a node to connect to and attempt to keep the connection open (see\n       the `addnode` RPC command help for more info). This option can be\n       specified multiple times to add multiple nodes.\n\n  -allowprivatenet\n       Allow RFC1918 addresses to be relayed and connected to (default: 0)\n\n  -asmap=&lt;file&gt;\n       Specify asn mapping used for bucketing of the peers (default:\n       ip_asn.map). Relative paths will be prefixed by the net-specific\n       datadir location.\n\n  -banscore=&lt;n&gt;\n       Threshold for disconnecting and discouraging misbehaving peers (default:\n       100)\n\n  -bantime=&lt;n&gt;\n       Default duration (in seconds) of manually configured bans (default:\n       86400)\n\n  -bind=&lt;addr&gt;\n       Bind to given address and always listen on it. Use [host]:port notation\n       for IPv6\n\n  -connect=&lt;ip&gt;\n       Connect only to the specified node; -noconnect disables automatic\n       connections (the rules for this peer are the same as for\n       -addnode). This option can be specified multiple times to connect\n       to multiple nodes.\n\n  -discover\n       Discover own IP addresses (default: 1 when listening and no -externalip\n       or -proxy)\n\n  -dns\n       Allow DNS lookups for -addnode, -seednode and -connect (default: 1)\n\n  -dnsseed\n       Query for peer addresses via DNS lookup, if low on addresses (default: 1\n       unless -connect used)\n\n  -enablebip61\n       Send reject messages per BIP61 (default: 1)\n\n  -externalip=&lt;ip&gt;\n       Specify your own public address\n\n  -forcednsseed\n       Always query for peer addresses via DNS lookup (default: 0)\n\n  -listen\n       Accept connections from outside (default: 1 if no -proxy or -connect)\n\n  -listenonion\n       Automatically create Tor hidden service (default: 1)\n\n  -maxconnections=&lt;n&gt;\n       Maintain at most &lt;n&gt; connections to peers (temporary service connections\n       excluded) (default: 125)\n\n  -maxreceivebuffer=&lt;n&gt;\n       Maximum per-connection receive buffer, &lt;n&gt;*1000 bytes (default: 5000)\n\n  -maxsendbuffer=&lt;n&gt;\n       Maximum per-connection send buffer, &lt;n&gt;*1000 bytes (default: 1000)\n\n  -maxtimeadjustment\n       Maximum allowed median peer time offset adjustment. Local perspective of\n       time may be influenced by peers forward or backward by this\n       amount. (default: 4200 seconds)\n\n  -maxuploadtarget=&lt;n&gt;\n       Tries to keep outbound traffic under the given target (in MiB per 24h),\n       0 = no limit (default: 0)\n\n  -natpmp\n       Use NAT-PMP to map the listening port (default: 0)\n\n  -onion=&lt;ip:port&gt;\n       Use separate SOCKS5 proxy to reach peers via Tor hidden services, set\n       -noonion to disable (default: -proxy)\n\n  -onlynet=&lt;net&gt;\n       Make outgoing connections only through network &lt;net&gt; (ipv4, ipv6 or\n       onion). Incoming connections are not affected by this option.\n       This option can be specified multiple times to allow multiple\n       networks.\n\n  -peerblockfilters\n       Serve compact block filters to peers per BIP 157 (default: 0)\n\n  -peerbloomfilters\n       Support filtering of blocks and transaction with bloom filters (default:\n       1)\n\n  -peertimeout=&lt;n&gt;\n       Specify p2p connection timeout in seconds. This option determines the\n       amount of time a peer may be inactive before the connection to it\n       is dropped. (minimum: 1, default: 60)\n\n  -permitbaremultisig\n       Relay non-P2SH multisig (default: 1)\n\n  -port=&lt;port&gt;\n       Listen for connections on &lt;port&gt; (default: 9999, testnet: 19999,\n       regtest: 19899)\n\n  -proxy=&lt;ip:port&gt;\n       Connect through SOCKS5 proxy, set -noproxy to disable (default:\n       disabled)\n\n  -proxyrandomize\n       Randomize credentials for every proxy connection. This enables Tor\n       stream isolation (default: 1)\n\n  -seednode=&lt;ip&gt;\n       Connect to a node to retrieve peer addresses, and disconnect. This\n       option can be specified multiple times to connect to multiple\n       nodes.\n\n  -socketevents=&lt;mode&gt;\n       Socket events mode, which must be one of &#39;select&#39;, &#39;poll&#39;, &#39;epoll&#39; or\n       &#39;kqueue&#39;, depending on your system (default: Linux - &#39;epoll&#39;,\n       FreeBSD&#x2F;Apple - &#39;kqueue&#39;, Windows - &#39;select&#39;)\n\n  -timeout=&lt;n&gt;\n       Specify connection timeout in milliseconds (minimum: 1, default: 5000)\n\n  -torcontrol=&lt;ip&gt;:&lt;port&gt;\n       Tor control port to use if onion listening enabled (default:\n       127.0.0.1:9051)\n\n  -torpassword=&lt;pass&gt;\n       Tor control port password (default: empty)\n\n  -upnp\n       Use UPnP to map the listening port (default: 0)\n\n  -whitebind=&lt;[permissions@]addr&gt;\n       Bind to given address and whitelist peers connecting to it. Use\n       [host]:port notation for IPv6. Allowed permissions are\n       bloomfilter (allow requesting BIP37 filtered blocks and\n       transactions), noban (do not ban for misbehavior), forcerelay\n       (relay even non-standard transactions), relay (relay even in\n       -blocksonly mode), and mempool (allow requesting BIP35 mempool\n       contents). Specify multiple permissions separated by commas\n       (default: noban,mempool,relay). Can be specified multiple times.\n\n  -whitelist=&lt;[permissions@]IP address or network&gt;\n       Whitelist peers connecting from the given IP address (e.g. 1.2.3.4) or\n       CIDR notated network(e.g. 1.2.3.0&#x2F;24). Uses same permissions as\n       -whitebind. Can be specified multiple times.\n</code></pre>\n<h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-indexing-options\"></div>Indexing options:<a class=\"fa fa-anchor\" href=\"#section-indexing-options\"></a></h2>\n<pre><code class=\"lang-text\">  -addressindex\n       Maintain a full address index, used to query for the balance, txids and\n       unspent outputs for addresses (default: 0)\n\n  -reindex\n       Rebuild chain state and block index from the blk*.dat files on disk\n\n  -reindex-chainstate\n       Rebuild chain state from the currently indexed blocks. When in pruning\n       mode or if blocks on disk might be corrupted, use full -reindex\n       instead.\n\n  -spentindex\n       Maintain a full spent index, used to query the spending txid and input\n       index for an outpoint (default: 0)\n\n  -timestampindex\n       Maintain a timestamp index for block hashes, used to query blocks hashes\n       by a range of timestamps (default: 0)\n\n  -txindex\n       Maintain a full transaction index, used by the getrawtransaction rpc\n       call (default: 1)\n</code></pre>\n<h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-wallet-options\"></div>Wallet options:<a class=\"fa fa-anchor\" href=\"#section-wallet-options\"></a></h2>\n<blockquote>\n<p>🚧 zapwallettxes</p>\n<p>Dash Core 18.1.0 removed the <code>-zapwallettxes</code> startup option and its functionality. This option was originally intended to allow for the fee bumping of transactions that did not signal RBF. This functionality has been superseded with the <a href=\"core-api-ref-remote-procedure-calls-wallet#abandontransaction\">abandon transaction capability</a> available via RPC/console or when right-clicking on unconfirmed transactions in Dash-Qt.</p>\n</blockquote>\n<pre><code class=\"lang-text\">  -avoidpartialspends\n       Group outputs by address, selecting all or none, instead of selecting on\n       a per-output basis. Privacy is improved as an address is only\n       used once (unless someone sends to it after spending from it),\n       but may result in slightly higher fees as suboptimal coin\n       selection may result due to the added limitation (default: 0\n       (always enabled for wallets with &quot;avoid_reuse&quot; enabled))\n\n  -createwalletbackups=&lt;n&gt;\n       Number of automatic wallet backups (default: 10)\n\n  -disablewallet\n       Do not load the wallet and disable wallet RPC calls\n\n  -instantsendnotify=&lt;cmd&gt;\n       Execute command when a wallet InstantSend transaction is successfully\n       locked (%s in cmd is replaced by TxID)\n\n  -keypool=&lt;n&gt;\n       Set key pool size to &lt;n&gt; (default: 1000)\n\n  -rescan=&lt;mode&gt;\n       Rescan the block chain for missing wallet transactions on startup (1 =\n       start from wallet creation time, 2 = start from genesis block)\n\n  -spendzeroconfchange\n       Spend unconfirmed change when sending transactions (default: 1)\n\n  -upgradewallet\n       Upgrade wallet to latest format on startup\n\n  -wallet=&lt;path&gt;\n       Specify wallet database path. Can be specified multiple times to load\n       multiple wallets. Path is interpreted relative to &lt;walletdir&gt; if\n       it is not absolute, and will be created if it does not exist (as\n       a directory containing a wallet.dat file and log files). For\n       backwards compatibility this will also accept names of existing\n       data files in &lt;walletdir&gt;.)\n\n  -walletbackupsdir=&lt;dir&gt;\n       Specify full path to directory for automatic wallet backups (must exist)\n\n  -walletbroadcast\n       Make the wallet broadcast transactions (default: 1)\n\n  -walletdir=&lt;dir&gt;\n       Specify directory to hold wallets (default: &lt;datadir&gt;&#x2F;wallets if it\n       exists, otherwise &lt;datadir&gt;)\n\n  -walletnotify=&lt;cmd&gt;\n       Execute command when a wallet transaction changes (%s in cmd is replaced\n       by TxID)\n</code></pre>\n<h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-wallet-fee-options\"></div>Wallet fee options:<a class=\"fa fa-anchor\" href=\"#section-wallet-fee-options\"></a></h2>\n<pre><code class=\"lang-text\">  -discardfee=&lt;amt&gt;\n       The fee rate (in DASH&#x2F;kB) that indicates your tolerance for discarding\n       change by adding it to the fee (default: 0.0001). Note: An output\n       is discarded if it is dust at this rate, but we will always\n       discard up to the dust relay fee and a discard fee above that is\n       limited by the fee estimate for the longest target\n\n  -fallbackfee=&lt;amt&gt;\n       A fee rate (in DASH&#x2F;kB) that will be used when fee estimation has\n       insufficient data (default: 0.00001)\n\n  -mintxfee=&lt;amt&gt;\n       Fees (in DASH&#x2F;kB) smaller than this are considered zero fee for\n       transaction creation (default: 0.00001)\n\n  -paytxfee=&lt;amt&gt;\n       Fee (in DASH&#x2F;kB) to add to transactions you send (default: 0.00)\n\n  -txconfirmtarget=&lt;n&gt;\n       If paytxfee is not set, include enough fee so transactions begin\n       confirmation on average within n blocks (default: 6)\n</code></pre>\n<h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-hd-wallet-options\"></div>HD wallet options:<a class=\"fa fa-anchor\" href=\"#section-hd-wallet-options\"></a></h2>\n<pre><code class=\"lang-text\">  -hdseed=&lt;hex&gt;\n       User defined seed for HD wallet (should be in hex). Only has effect\n       during wallet creation&#x2F;first start (default: randomly generated)\n\n  -mnemonic=&lt;text&gt;\n       User defined mnemonic for HD wallet (bip39). Only has effect during\n       wallet creation&#x2F;first start (default: randomly generated)\n\n  -mnemonicpassphrase=&lt;text&gt;\n       User defined mnemonic passphrase for HD wallet (BIP39). Only has effect\n       during wallet creation&#x2F;first start (default: empty string)\n\n  -usehd\n       Use hierarchical deterministic key generation (HD) after BIP39&#x2F;BIP44.\n       Only has effect during wallet creation&#x2F;first start (default: 0)\n</code></pre>\n<h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-coin-join-options\"></div>CoinJoin options:<a class=\"fa fa-anchor\" href=\"#section-coin-join-options\"></a></h2>\n<pre><code>  -coinjoinamount=&lt;n&gt;\n       Target CoinJoin balance (2-21000000, default: 1000)\n\n  -coinjoinautostart\n       Start CoinJoin automatically (0-1, default: 0)\n\n  -coinjoindenomsgoal=&lt;n&gt;\n       Try to create at least N inputs of each denominated amount (10-100000,\n       default: 50)\n\n  -coinjoindenomshardcap=&lt;n&gt;\n       Create up to N inputs of each denominated amount (10-100000, default:\n       300)\n\n  -coinjoinmultisession\n       Enable multiple CoinJoin mixing sessions per block, experimental (0-1,\n       default: 0)\n\n  -coinjoinrounds=&lt;n&gt;\n       Use N separate masternodes for each denominated input to mix funds\n       (2-16, default: 4)\n\n  -coinjoinsessions=&lt;n&gt;\n       Use N separate masternodes in parallel to mix funds (1-10, default: 4)\n\n  -enablecoinjoin\n       Enable use of CoinJoin for funds stored in this wallet (0-1, default: 0)\n</code></pre><h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-zero-mq-notification-options\"></div>ZeroMQ notification options:<a class=\"fa fa-anchor\" href=\"#section-zero-mq-notification-options\"></a></h2>\n<pre><code>  -zmqpubhashblock=&lt;address&gt;\n       Enable publish hash block in &lt;address&gt;\n\n  -zmqpubhashblockhwm=&lt;n&gt;\n       Set publish hash block outbound message high water mark (default: 1000)\n\n  -zmqpubhashchainlock=&lt;address&gt;\n       Enable publish hash block (locked via ChainLocks) in &lt;address&gt;\n\n  -zmqpubhashchainlockhwm=&lt;n&gt;\n       Set publish hash chain lock outbound message high water mark (default:\n       1000)\n\n  -zmqpubhashgovernanceobject=&lt;address&gt;\n       Enable publish hash of governance objects (like proposals) in &lt;address&gt;\n\n  -zmqpubhashgovernanceobjecthwm=&lt;n&gt;\n       Set publish hash governance object outbound message high water mark\n       (default: 1000)\n\n  -zmqpubhashgovernancevote=&lt;address&gt;\n       Enable publish hash of governance votes in &lt;address&gt;\n\n  -zmqpubhashgovernancevotehwm=&lt;n&gt;\n       Set publish hash governance vote outbound message high water mark\n       (default: 1000)\n\n  -zmqpubhashinstantsenddoublespend=&lt;address&gt;\n       Enable publish transaction hashes of attempted InstantSend double spend\n       in &lt;address&gt;\n\n  -zmqpubhashinstantsenddoublespendhwm=&lt;n&gt;\n       Set publish hash InstantSend double spend outbound message high water\n       mark (default: 1000)\n\n  -zmqpubhashrecoveredsig=&lt;address&gt;\n       Enable publish message hash of recovered signatures (recovered by LLMQs)\n       in &lt;address&gt;\n\n  -zmqpubhashrecoveredsighwm=&lt;n&gt;\n       Set publish hash recovered signature outbound message high water mark\n       (default: 1000)\n\n  -zmqpubhashtx=&lt;address&gt;\n       Enable publish hash transaction in &lt;address&gt;\n\n  -zmqpubhashtxhwm=&lt;n&gt;\n       Set publish hash transaction outbound message high water mark (default:\n       1000)\n\n  -zmqpubhashtxlock=&lt;address&gt;\n       Enable publish hash transaction (locked via InstantSend) in &lt;address&gt;\n\n  -zmqpubhashtxlockhwm=&lt;n&gt;\n       Set publish hash transaction lock outbound message high water mark\n       (default: 1000)\n\n  -zmqpubrawblock=&lt;address&gt;\n       Enable publish raw block in &lt;address&gt;\n\n  -zmqpubrawblockhwm=&lt;n&gt;\n       Set publish raw block outbound message high water mark (default: 1000)\n\n  -zmqpubrawchainlock=&lt;address&gt;\n       Enable publish raw block (locked via ChainLocks) in &lt;address&gt;\n\n  -zmqpubrawchainlockhwm=&lt;n&gt;\n       Set publish raw chain lock outbound message high water mark (default:\n       1000)\n\n  -zmqpubrawchainlocksig=&lt;address&gt;\n       Enable publish raw block (locked via ChainLocks) and CLSIG message in\n       &lt;address&gt;\n\n  -zmqpubrawchainlocksighwm=&lt;n&gt;\n       Set publish raw chain lock signature outbound message high water mark\n       (default: 1000)\n\n  -zmqpubrawgovernanceobject=&lt;address&gt;\n       Enable publish raw governance votes in &lt;address&gt;\n\n  -zmqpubrawgovernanceobjecthwm=&lt;n&gt;\n       Set publish raw governance object outbound message high water mark\n       (default: 1000)\n\n  -zmqpubrawgovernancevote=&lt;address&gt;\n       Enable publish raw governance objects (like proposals) in &lt;address&gt;\n\n  -zmqpubrawgovernancevotehwm=&lt;n&gt;\n       Set publish raw governance vote outbound message high water mark\n       (default: 1000)\n\n  -zmqpubrawinstantsenddoublespend=&lt;address&gt;\n       Enable publish raw transactions of attempted InstantSend double spend in\n       &lt;address&gt;\n\n  -zmqpubrawinstantsenddoublespendhwm=&lt;n&gt;\n       Set publish raw InstantSend double spend outbound message high water\n       mark (default: 1000)\n\n  -zmqpubrawrecoveredsig=&lt;address&gt;\n       Enable publish raw recovered signatures (recovered by LLMQs) in\n       &lt;address&gt;\n\n  -zmqpubrawrecoveredsighwm=&lt;n&gt;\n       Set publish raw recovered signature outbound message high water mark\n       (default: 1000)\n\n  -zmqpubrawtx=&lt;address&gt;\n       Enable publish raw transaction in &lt;address&gt;\n\n  -zmqpubrawtxhwm=&lt;n&gt;\n       Set publish raw transaction outbound message high water mark (default:\n       1000)\n\n  -zmqpubrawtxlock=&lt;address&gt;\n       Enable publish raw transaction (locked via InstantSend) in &lt;address&gt;\n\n  -zmqpubrawtxlockhwm=&lt;n&gt;\n       Set publish raw transaction lock outbound message high water mark\n       (default: 1000)\n\n  -zmqpubrawtxlocksig=&lt;address&gt;\n       Enable publish raw transaction (locked via InstantSend) and ISLOCK in\n       &lt;address&gt;\n\n  -zmqpubrawtxlocksighwm=&lt;n&gt;\n       Set publish raw transaction lock signature outbound message high water\n       mark (default: 1000)\n</code></pre><h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-debugging-testing-options\"></div>Debugging/Testing options:<a class=\"fa fa-anchor\" href=\"#section-debugging-testing-options\"></a></h2>\n<pre><code>  -addrmantest\n       Allows to test address relay on localhost\n\n  -checkblockindex\n       Do a consistency check for the block tree, and  occasionally. (default:\n       0, regtest: 1)\n\n  -checkblocks=&lt;n&gt;\n       How many blocks to check at startup (default: 6, 0 = all)\n\n  -checklevel=&lt;n&gt;\n       How thorough the block verification of -checkblocks is: level 0 reads\n       the blocks from disk, level 1 verifies block validity, level 2\n       verifies undo data, level 3 checks disconnection of tip blocks,\n       and level 4 tries to reconnect the blocks, each level includes\n       the checks of the previous levels (0-4, default: 3)\n\n  -checkmempool=&lt;n&gt;\n       Run checks every &lt;n&gt; transactions (default: 0, regtest: 1)\n\n  -checkpoints\n       Enable rejection of any forks from the known historical chain until\n       block 1450000 (default: 1)\n\n  -debug=&lt;category&gt;\n       Output debugging information (default: -nodebug, supplying &lt;category&gt; is\n       optional). If &lt;category&gt; is not supplied or if &lt;category&gt; = 1,\n       output all debugging information. &lt;category&gt; can be: net, tor,\n       mempool, http, bench, zmq, walletdb, rpc, estimatefee, addrman,\n       selectcoins, reindex, cmpctblock, rand, prune, proxy, mempoolrej,\n       libevent, coindb, qt, leveldb, chainlocks, gobject, instantsend,\n       llmq, llmq-dkg, llmq-sigs, mnpayments, mnsync, coinjoin, spork,\n       netconn.\n\n  -debugexclude=&lt;category&gt;\n       Exclude debugging information for a category. Can be used in conjunction\n       with -debug=1 to output debug logs for all categories except one\n       or more specified categories.\n\n  -deprecatedrpc=&lt;method&gt;\n       Allows deprecated RPC method(s) to be used\n\n  -disablegovernance\n       Disable governance validation (0-1, default: 0)\n\n  -dropmessagestest=&lt;n&gt;\n       Randomly drop 1 of every &lt;n&gt; network messages\n\n  -help-debug\n       Print help message with debugging options and exit\n\n  -limitancestorcount=&lt;n&gt;\n       Do not accept transactions if number of in-mempool ancestors is &lt;n&gt; or\n       more (default: 25)\n\n  -limitancestorsize=&lt;n&gt;\n       Do not accept transactions whose size with all in-mempool ancestors\n       exceeds &lt;n&gt; kilobytes (default: 101)\n\n  -limitdescendantcount=&lt;n&gt;\n       Do not accept transactions if any ancestor would have &lt;n&gt; or more\n       in-mempool descendants (default: 25)\n\n  -limitdescendantsize=&lt;n&gt;\n       Do not accept transactions if any ancestor would have more than &lt;n&gt;\n       kilobytes of in-mempool descendants (default: 101).\n\n  -logips\n       Include IP addresses in debug output (default: 0)\n\n  -logthreadnames\n       Prepend debug output with name of the originating thread (only available\n       on platforms supporting thread_local) (default: 0)\n\n  -logtimemicros\n       Add microsecond precision to debug timestamps (default: 0)\n\n  -logtimestamps\n       Prepend debug output with timestamp (default: 1)\n\n  -maxsigcachesize=&lt;n&gt;\n       Limit sum of signature cache and script execution cache sizes to &lt;n&gt; MiB\n       (default: 32)\n\n  -maxtipage=&lt;n&gt;\n       Maximum tip age in seconds to consider node in initial block download\n       (default: 21600)\n\n  -maxtxfee=&lt;amt&gt;\n       Maximum total fees (in DASH) to use in a single wallet transaction;\n       setting this too low may abort large transactions (default: 0.10)\n\n  -minsporkkeys=&lt;n&gt;\n       Overrides minimum spork signers to change spork value. Only useful for\n       regtest and devnet. Using this on mainnet or testnet will ban\n       you.\n\n  -mocktime=&lt;n&gt;\n       Replace actual time with UNIX epoch time(default: 0)\n\n  -printpriority\n       Log transaction fee per kB when mining blocks (default: 0)\n\n  -printtoconsole\n       Send trace/debug info to console (default: 1 when no -daemon. To disable\n       logging to file, set -nodebuglogfile)\n\n  -pushversion\n       Protocol version to report to other nodes\n\n  -shrinkdebugfile\n       Shrink debug.log file on client startup (default: 1 when no -debug)\n\n  -sporkaddr=&lt;dashaddress&gt;\n       Override spork address. Only useful for regtest and devnet. Using this\n       on mainnet or testnet will ban you.\n\n  -sporkkey=&lt;privatekey&gt;\n       Set the private key to be used for signing spork messages.\n\n  -stopafterblockimport\n       Stop running after importing blocks from disk (default: 0)\n\n  -stopatheight\n       Stop running after reaching the given height in the main chain (default:\n       0)\n\n  -uacomment=&lt;cmt&gt;\n       Append comment to the user agent string\n\n  -watchquorums=&lt;n&gt;\n       Watch and validate quorum communication (default: 0)\n</code></pre><h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-chain-selection-options\"></div>Chain selection options:<a class=\"fa fa-anchor\" href=\"#section-chain-selection-options\"></a></h2>\n<pre><code>  -budgetparams=&lt;masternode&gt;:&lt;budget&gt;:&lt;superblock&gt;\n       Override masternode, budget and superblock start heights (regtest-only)\n\n  -devnet=&lt;name&gt;\n       Use devnet chain with provided name\n\n  -dip3params=&lt;activation&gt;:&lt;enforcement&gt;\n       Override DIP3 activation and enforcement heights (regtest-only)\n\n  -dip8params=&lt;activation&gt;\n       Override DIP8 activation height (regtest-only)\n\n  -highsubsidyblocks=&lt;n&gt;\n       The number of blocks with a higher than normal subsidy to mine at the\n       start of a chain (default: 0, devnet-only)\n\n  -highsubsidyfactor=&lt;n&gt;\n       The factor to multiply the normal block subsidy by while in the\n       highsubsidyblocks window of a chain (default: 1, devnet-only)\n\n  -llmqchainlocks=&lt;quorum name&gt;\n       Override the default LLMQ type used for ChainLocks. Allows using\n       ChainLocks with smaller LLMQs. (default: llmq_50_60, devnet-only)\n\n  -llmqdevnetparams=&lt;size&gt;:&lt;threshold&gt;\n       Override the default LLMQ size for the LLMQ_DEVNET quorum (default: 3:2,\n       devnet-only)\n\n  -llmqinstantsend=&lt;quorum name&gt;\n       Override the default LLMQ type used for InstantSend. Allows using\n       InstantSend with smaller LLMQs. (default: llmq_50_60,\n       devnet-only)\n\n  -llmqinstantsenddip0024=&lt;quorum name&gt;\n       Override the default LLMQ type used for InstantSendDIP0024. (default:\n       llmq_60_75, devnet-only)\n\n  -llmqtestinstantsendparams=&lt;size&gt;:&lt;threshold&gt;\n       Override the default LLMQ size for the LLMQ_TEST_INSTANTSEND quorums\n       (default: 3:2, regtest-only)\n\n  -llmqtestparams=&lt;size&gt;:&lt;threshold&gt;\n       Override the default LLMQ size for the LLMQ_TEST quorum (default: 3:2,\n       regtest-only)\n\n  -minimumdifficultyblocks=&lt;n&gt;\n       The number of blocks that can be mined with the minimum difficulty at\n       the start of a chain (default: 0, devnet-only)\n\n  -powtargetspacing=&lt;n&gt;\n       Override the default PowTargetSpacing value in seconds (default: 2.5\n       minutes, devnet-only)\n\n  -regtest\n       Enter regression test mode, which uses a special chain in which blocks\n       can be solved instantly. This is intended for regression testing\n       tools and app development.\n\n  -testnet\n       Use the test chain\n\n  -vbparams=&lt;deployment&gt;:&lt;start&gt;:&lt;end&gt;(:&lt;window&gt;:&lt;threshold/thresholdstart&gt;(:&lt;thresholdmin&gt;:&lt;falloffcoeff&gt;))\n       Use given start/end times for specified version bits deployment\n       (regtest-only). Specifying window, threshold/thresholdstart,\n       thresholdmin and falloffcoeff is optional.\n</code></pre><h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-masternode-options\"></div>Masternode options:<a class=\"fa fa-anchor\" href=\"#section-masternode-options\"></a></h2>\n<pre><code>  -llmq-data-recovery=&lt;n&gt;\n       Enable automated quorum data recovery (default: 1)\n\n  -llmq-qvvec-sync=&lt;quorum_name&gt;:&lt;mode&gt;\n       Defines from which LLMQ type the masternode should sync quorum\n       verification vectors. Can be used multiple times with different\n       LLMQ types. &lt;mode&gt;: 0 (sync always from all quorums of the type\n       defined by &lt;quorum_name&gt;), 1 (sync from all quorums of the type\n       defined by &lt;quorum_name&gt; if a member of any of the quorums)\n\n  -masternodeblsprivkey=&lt;hex&gt;\n       Set the masternode BLS private key and enable the client to act as a\n       masternode\n\n  -platform-user=&lt;user&gt;\n       Set the username for the &quot;platform user&quot;, a restricted user intended to\n       be used by Dash Platform, to the specified username.\n</code></pre><h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-node-relay-options\"></div>Node relay options:<a class=\"fa fa-anchor\" href=\"#section-node-relay-options\"></a></h2>\n<pre><code>  -acceptnonstdtxn\n       Relay and mine &quot;non-standard&quot; transactions (testnet/regtest only;\n       default: 1)\n\n  -bytespersigop\n       Equivalent bytes per sigop in transactions for relay and mining\n       (default: 20)\n\n  -datacarrier\n       Relay and mine data carrier transactions (default: 1)\n\n  -datacarriersize\n       Maximum size of data in data carrier transactions we relay and mine\n       (default: 83)\n\n  -dustrelayfee=&lt;amt&gt;\n       Fee rate (in DASH/kB) used to define dust, the value of an output such\n       that it will cost more than its value in fees at this fee rate to\n       spend it. (default: 0.00003)\n\n  -incrementalrelayfee=&lt;amt&gt;\n       Fee rate (in DASH/kB) used to define cost of relay, used for mempool\n       limiting and BIP 125 replacement. (default: 0.00001)\n\n  -minrelaytxfee=&lt;amt&gt;\n       Fees (in DASH/kB) smaller than this are considered zero fee for\n       relaying, mining and transaction creation (default: 0.00001)\n\n  -whitelistforcerelay\n       Add &#39;forcerelay&#39; permission to whitelisted inbound peers with default\n       permissions. This will relay transactions even if the\n       transactions were already in the mempool or violate local relay\n       policy. (default: 0)\n\n  -whitelistrelay\n       Add &#39;relay&#39; permission to whitelisted inbound peers with default\n       permissions. This will accept relayed transactions even when not\n       relaying transactions (default: 1)\n</code></pre><h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-block-creation-options\"></div>Block creation options:<a class=\"fa fa-anchor\" href=\"#section-block-creation-options\"></a></h2>\n<pre><code>  -blockmaxsize=&lt;n&gt;\n       Set maximum block size in bytes (default: 2000000)\n\n  -blockmintxfee=&lt;amt&gt;\n       Set lowest fee rate (in DASH/kB) for transactions to be included in\n       block creation. (default: 0.00001)\n\n  -blockversion=&lt;n&gt;\n       Override block version to test forking scenarios\n</code></pre><h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-rpc-server-options\"></div>RPC server options:<a class=\"fa fa-anchor\" href=\"#section-rpc-server-options\"></a></h2>\n<pre><code>  -rest\n       Accept public REST requests (default: 0)\n\n  -rpcallowip=&lt;ip&gt;\n       Allow JSON-RPC connections from specified source. Valid for &lt;ip&gt; are a\n       single IP (e.g. 1.2.3.4), a network/netmask (e.g.\n       1.2.3.4/255.255.255.0) or a network/CIDR (e.g. 1.2.3.4/24). This\n       option can be specified multiple times\n\n  -rpcauth=&lt;userpw&gt;\n       Username and HMAC-SHA-256 hashed password for JSON-RPC connections. The\n       field &lt;userpw&gt; comes in the format: &lt;USERNAME&gt;:&lt;SALT&gt;$&lt;HASH&gt;. A\n       canonical python script is included in share/rpcuser. The client\n       then connects normally using the\n       rpcuser=&lt;USERNAME&gt;/rpcpassword=&lt;PASSWORD&gt; pair of arguments. This\n       option can be specified multiple times\n\n  -rpcbind=&lt;addr&gt;[:port]\n       Bind to given address to listen for JSON-RPC connections. Do not expose\n       the RPC server to untrusted networks such as the public internet!\n       This option is ignored unless -rpcallowip is also passed. Port is\n       optional and overrides -rpcport. Use [host]:port notation for\n       IPv6. This option can be specified multiple times (default:\n       127.0.0.1 and ::1 i.e., localhost, or if -rpcallowip has been\n       specified, 0.0.0.0 and :: i.e., all addresses)\n\n  -rpccookiefile=&lt;loc&gt;\n       Location of the auth cookie. Relative paths will be prefixed by a\n       net-specific datadir location. (default: data dir)\n\n  -rpcpassword=&lt;pw&gt;\n       Password for JSON-RPC connections\n\n  -rpcport=&lt;port&gt;\n       Listen for JSON-RPC connections on &lt;port&gt; (default: 9998, testnet:\n       19998, regtest: 19898)\n\n  -rpcservertimeout=&lt;n&gt;\n       Timeout during HTTP requests (default: 30)\n\n  -rpcthreads=&lt;n&gt;\n       Set the number of threads to service RPC calls (default: 4)\n\n  -rpcuser=&lt;user&gt;\n       Username for JSON-RPC connections\n\n  -rpcwhitelist=&lt;whitelist&gt;\n       Set a whitelist to filter incoming RPC calls for a specific user. The\n       field &lt;whitelist&gt; comes in the format: &lt;USERNAME&gt;:&lt;rpc 1&gt;,&lt;rpc\n       2&gt;,...,&lt;rpc n&gt;. If multiple whitelists are set for a given user,\n       they are set-intersected. See -rpcwhitelistdefault documentation\n       for information on default whitelist behavior.\n\n  -rpcwhitelistdefault\n       Sets default behavior for rpc whitelisting. Unless rpcwhitelistdefault\n       is set to 0, if any -rpcwhitelist is set, the rpc server acts as\n       if all rpc users are subject to empty-unless-otherwise-specified\n       whitelists. If rpcwhitelistdefault is set to 1 and no\n       -rpcwhitelist is set, rpc server acts as if all rpc users are\n       subject to empty whitelists.\n\n  -rpcworkqueue=&lt;n&gt;\n       Set the depth of the work queue to service RPC calls (default: 16)\n\n  -server\n       Accept command line and JSON-RPC commands\n</code></pre><h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-statsd-options\"></div>Statsd options:<a class=\"fa fa-anchor\" href=\"#section-statsd-options\"></a></h2>\n<pre><code class=\"lang-text\">  -statsenabled\n       Publish internal stats to statsd (default: 0)\n\n  -statshost=&lt;ip&gt;\n       Specify statsd host (default: 127.0.0.1)\n\n  -statshostname=&lt;ip&gt;\n       Specify statsd host name (default: )\n\n  -statsns=&lt;ns&gt;\n       Specify additional namespace prefix (default: )\n\n  -statsperiod=&lt;seconds&gt;\n       Specify the number of seconds between periodic measurements (default:\n       60)\n\n  -statsport=&lt;port&gt;\n       Specify statsd port (default: 8125)\n</code></pre>\n<h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-wallet-debugging-testing-options\"></div>Wallet debugging/testing options:<a class=\"fa fa-anchor\" href=\"#section-wallet-debugging-testing-options\"></a></h2>\n\n</div>\n<div class=\"magic-block-callout type-warning no-title\"><span class=\"noTitleIcon\"><i title=\"Warning\" class=\"fa fa-exclamation-circle\"></i></span>\n\t<div class=\"callout-body\"><p>These options are normally hidden and will only be shown if using the help debug option: <code>dashd --held -help-debug</code></p>\n\n\t</div>\n</div>\n<div class=\"magic-block-textarea\"><pre><code class=\"lang-text\">  -dblogsize=&lt;n&gt;\n       Flush wallet database activity from memory to disk log every &lt;n&gt;\n       megabytes (default: 100)\n\n  -flushwallet\n       Run a thread to flush wallet periodically (default: 1)\n\n  -privdb\n       Sets the DB_PRIVATE flag in the wallet db environment (default: 1)\n\n  -walletrejectlongchains\n       Wallet will not create transactions that violate mempool chain limits\n       (default: 0)\n</code></pre>\n<h1 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-network-dependent-options\"></div>Network Dependent Options<a class=\"fa fa-anchor\" href=\"#section-network-dependent-options\"></a></h1>\n<p>The following options can only be used for specific network types. These options are provided support development (devnet) and regression test (regtest) networks.</p>\n<h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-devnet-options\"></div>Devnet Options<a class=\"fa fa-anchor\" href=\"#section-devnet-options\"></a></h2>\n<pre><code class=\"lang-text\">  -highsubsidyblocks=&lt;n&gt;\n       The number of blocks with a higher than normal subsidy to mine at the\n       start of a chain (default: 0, devnet-only)\n\n  -highsubsidyfactor=&lt;n&gt;\n       The factor to multiply the normal block subsidy by while in the\n       highsubsidyblocks window of a chain (default: 1, devnet-only)\n\n  -llmqchainlocks=&lt;quorum name&gt;\n       Override the default LLMQ type used for ChainLocks. Allows using\n       ChainLocks with smaller LLMQs. (default: llmq_50_60, devnet-only)\n\n  -llmqdevnetparams=&lt;size&gt;:&lt;threshold&gt;\n       Override the default LLMQ size for the LLMQ_DEVNET quorum (default: 3:2,\n       devnet-only)\n\n  -llmqinstantsend=&lt;quorum name&gt;\n       Override the default LLMQ type used for InstantSend. Allows using\n       InstantSend with smaller LLMQs. (default: llmq_50_60,\n       devnet-only)\n\n  -llmqinstantsenddip0024=&lt;quorum name&gt;\n       Override the default LLMQ type used for InstantSendDIP0024. (default:\n       llmq_60_75, devnet-only)\n\n  -minimumdifficultyblocks=&lt;n&gt;\n       The number of blocks that can be mined with the minimum difficulty at\n       the start of a chain (default: 0, devnet-only)\n\n  -powtargetspacing=&lt;n&gt;\n       Override the default PowTargetSpacing value in seconds (default: 2.5\n       minutes, devnet-only)\n</code></pre>\n<p>The quorum names used in these options are:</p>\n<div class=\"marked-table\"><table>\n<thead>\n<tr>\n<th style=\"text-align:center\">LLMQ Type</th>\n<th>LLMQ Name</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:center\">1</td>\n<td>llmq50_60</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">2</td>\n<td>llmq400_60</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">3</td>\n<td>llmq400_85</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">4</td>\n<td>llmq100_67</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">5</td>\n<td>llmq60_75</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">100</td>\n<td>llmq_test</td>\n</tr>\n<tr>\n<td style=\"text-align:center\">101</td>\n<td>llmq_devnet</td>\n</tr>\n</tbody>\n</table></div>\n<p>Refer to <a href=\"https://github.com/dashpay/dips/blob/master/dip-0006.md#current-llmq-types\">this table in DIP-6 - LLMQs</a> for details on each quorum type.</p>\n<h2 class=\"header-scroll\"><div class=\"anchor waypoint\" id=\"section-regtest-options\"></div>Regtest Options<a class=\"fa fa-anchor\" href=\"#section-regtest-options\"></a></h2>\n<pre><code>  -budgetparams=&lt;masternode&gt;:&lt;budget&gt;:&lt;superblock&gt;\n       Override masternode, budget and superblock start heights (regtest-only)\n\n  -dip3params=&lt;activation&gt;:&lt;enforcement&gt;\n       Override DIP3 activation and enforcement heights (regtest-only)\n\n  -dip8params=&lt;activation&gt;\n       Override DIP8 activation height (regtest-only)\n\n  -llmqtestinstantsendparams=&lt;size&gt;:&lt;threshold&gt;\n       Override the default LLMQ size for the LLMQ_TEST_INSTANTSEND quorums\n       (default: 3:2, regtest-only)\n\n  -llmqtestparams=&lt;size&gt;:&lt;threshold&gt;\n       Override the default LLMQ size for the LLMQ_TEST quorum (default: 3:2,\n       regtest-only)\n\n  -vbparams=&lt;deployment&gt;:&lt;start&gt;:&lt;end&gt;(:&lt;window&gt;:&lt;threshold/thresholdstart&gt;(:&lt;thresholdmin&gt;:&lt;falloffcoeff&gt;))\n       Use given start/end times for specified version bits deployment\n       (regtest-only). Specifying window, threshold/thresholdstart,\n       thresholdmin and falloffcoeff is optional.\n</code></pre>\n</div>"
}